#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
panos_panorama_device_group.this: Refreshing state... [id=policy-as-code]
panos_antivirus_security_profile.example: Refreshing state... [id=policy-as-code:av]
panos_panorama_security_rule_group.this: Refreshing state... [id=policy-as-code:pre-rulebase:vsys1:0::YWxsb3cgZG5zIGZyb20gYXBwcwphbGxvdyBpbnRlcm5ldCBmcm9tIGJpemRldiB4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # panos_antivirus_security_profile.example must be replaced
-/+ resource "panos_antivirus_security_profile" "example" {
      ~ device_group      = "policy-as-code" -> "production" # forces replacement
      ~ id                = "policy-as-code:av" -> (known after apply)
        name              = "av"
      - packet_capture    = false -> null
      - threat_exceptions = [] -> null
        # (2 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # panos_panorama_device_group.this must be replaced
-/+ resource "panos_panorama_device_group" "this" {
      ~ id          = "policy-as-code" -> (known after apply)
      ~ name        = "policy-as-code" -> "production" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # panos_panorama_security_rule_group.this must be replaced
-/+ resource "panos_panorama_security_rule_group" "this" {
      ~ device_group       = "policy-as-code" -> "production" # forces replacement
      ~ id                 = "policy-as-code:pre-rulebase:vsys1:0::YWxsb3cgZG5zIGZyb20gYXBwcwphbGxvdyBpbnRlcm5ldCBmcm9tIGJpemRldiB4" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ rule {
          - destination_devices                = [] -> null
          - disable_server_response_inspection = false -> null
          - disabled                           = false -> null
          ~ hip_profiles                       = [
              + "any",
            ]
          - icmp_unreachable                   = false -> null
          - log_start                          = false -> null
            name                               = "allow dns from apps"
          - negate_destination                 = false -> null
          - negate_source                      = false -> null
          - negate_target                      = false -> null
          - source_devices                     = [] -> null
          - tags                               = [] -> null
          ~ uuid                               = "c8d0e340-2a4a-4553-97c6-424feb8b0e5e" -> (known after apply)
            # (24 unchanged attributes hidden)
        }
      ~ rule {
          - destination_devices                = [] -> null
          - disable_server_response_inspection = false -> null
          - disabled                           = false -> null
          ~ hip_profiles                       = [
              + "any",
            ]
          - icmp_unreachable                   = false -> null
          - log_start                          = false -> null
            name                               = "allow internet from bizdev x"
          - negate_destination                 = false -> null
          - negate_source                      = false -> null
          - negate_target                      = false -> null
          - source_devices                     = [] -> null
          - tags                               = [] -> null
          ~ uuid                               = "4b447fad-aeed-419b-a210-15b69e52d9f7" -> (known after apply)
            # (24 unchanged attributes hidden)
        }
    }

  # panos_panorama_static_route_ipv4.this["azure"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "172.16.0.0/16"
      + id             = (known after apply)
      + metric         = 10
      + name           = "azure"
      + next_hop       = "172.16.0.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_static_route_ipv4.this["default"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "0.0.0.0/0"
      + id             = (known after apply)
      + metric         = 10
      + name           = "default"
      + next_hop       = "10.2.1.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_static_route_ipv4.this["on-prem"] will be created
  + resource "panos_panorama_static_route_ipv4" "this" {
      + destination    = "192.168.0.0/16"
      + id             = (known after apply)
      + metric         = 10
      + name           = "on-prem"
      + next_hop       = "192.168.0.1"
      + route_table    = "unicast"
      + template       = "production TPL"
      + type           = "ip-address"
      + virtual_router = "vr"
    }

  # panos_panorama_template.this will be created
  + resource "panos_panorama_template" "this" {
      + default_vsys = (known after apply)
      + description  = "production template"
      + id           = (known after apply)
      + name         = "production TPL"
    }

  # panos_panorama_template_stack.this will be created
  + resource "panos_panorama_template_stack" "this" {
      + description = "production TPL STK"
      + devices     = (known after apply)
      + id          = (known after apply)
      + name        = "production TPL STK"
      + templates   = [
          + "production TPL",
        ]
    }

  # panos_panorama_virtual_router.this will be created
  + resource "panos_panorama_virtual_router" "this" {
      + ebgp_dist        = 20
      + ibgp_dist        = 200
      + id               = (known after apply)
      + interfaces       = (known after apply)
      + name             = "vr"
      + ospf_ext_dist    = 110
      + ospf_int_dist    = 30
      + ospfv3_ext_dist  = 110
      + ospfv3_int_dist  = 30
      + rip_dist         = 120
      + static_dist      = 15
      + static_ipv6_dist = 10
      + template         = "production TPL"
    }

Plan: 9 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @migara, Action: `pull_request`*